Autodesk.Revit.DB.Macros.Macro.Execute
Executes the macro.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the module is a document module and the Macro is disabled for the document,
or there is a open transaction of the entrypoint's document,
or the transaction mode assinged to this macro module assigned is invalid for the entrypoint's document,
such as ReadOnly or Automatic transaction mode for the entrypoint without document,
or this is a DB module macro but be executed in UI environment,
or macro failed to execute.
Since:
2014

Autodesk.Revit.DB.Macros.Macro.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Macros.Macro.MacroModule
The Macro module.
Since:
2014

Autodesk.Revit.DB.Macros.Macro.Name
The macro name.
Since:
2014

Autodesk.Revit.DB.Macros.Macro
An individual Autodesk Revit Macro which can be executed.
Since:
2014